package dev.tomco.a23a_10357_l02;

import java.util.ArrayList;

public class GameManager {
    private boolean isLocked;

    private int[] flags = new int[]{
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0
    };

    private String[] names = new String[]{
            "מה מהמשימות הבאות אינה חלק ממטלותיו של ה product owner  כאשר עובדים במתודולוגית scrum?",
            "מה מכל הבאים להלן, הינו בעל ה roi הטוב ביותר?",
            "\"המערכת נראית כתקועה, לא קורה דבר ורק לאחר פרק זמן ממושך יחסית, יש הודעה על סיום ההתקנה. \" איזו בעיה מתוארת כאן?",
            "נתונות המשימות הבאות. לפי תהליך הבדיקות הבסיסי למדנו, מהו הסדר הנכון למשימות אלה? א. קביעת תוצאה בפועל, ב. הגדרת תנאי בדיקה, ג. ערבול נתונים, ד. בחירת רמת כסוי",
            "מה מכל הבאים, יכול בוודאות להגדיל א ה- CC ?",
            "נתון דיווח התקלה הבא: \"הזנתי בתיבת החיפוש את הערך ‘Tuesday ‘ולא התקבלו תוצאות. כאשר הזנתי את הערך ’ Tuesday   ‘(כלומר- עם 3רווחים בסוף הסטרינג) התקבלו תוצאות המתאימות לערך החיפוש\". אילו בדיקות נוספות כדאי לבצע כאן, כדי לבודד את הבעיה?",
            "מחלקת הבדיקות דיווחה על תקלה. הפיתוח מחזיר את התקלה אך התקלה לא נסגרת, וכבר 3 פעמים עברה בין מצב fixed ל re-open, וזאת עקב כך שבעת התקנת התוכנה על סביבת הבדיקות שכחו להוסיף ספריה אחת. באיזה שלב של תהליך הבדיקות הבסיסי, ניתן היה למנוע בעיה זו?",
            "בודק חרוץ במיוחד כתב אוטומציה שעובדת. שכנו לקיוביקל בקש להעזר בקוד של אותו בודק, והריץ אותה על גרסת תוכנה הזהה לזו אצל הבודק, אך אצל השכן הקוד אמנם מתקמפל ורץ- אבל לא מפעיל את המערכת הנבדקת כראוי. מה הסיבה הכי הגיונית לבעיה?",
            "מה מהבאים יכול בוודאות לגרום להארכה של הנתיב הקריטי, בעת ביצוע בדיקות ביצועים על שרת ?",
            "מה מהמשימות הבאות אינה חלק ממטלותיו של צוות פיתוח אג'ילי?",
            "נתון הקוד הבא:" +
                    "\nRead x;" +
                    "\nY=0;" +
                    "\nIf (x>5) print “hello” " +
                    "\nElse{" +
                    "\nY= x-1;" +
                    "\nx=x/(5-x);" +
                    "\n}" +
                    "\nמה נכון לגבי הקוד הזה?",
            "מה מכל הבאים להלן, הינו גישת בדיקות data driven ?",
            "\"במהלך ההתקנה מחכים לקוד אישור. אך עד שמגיע הקוד, המערכת מדווחת על time out ואז כל ההתקנה נכשלת\". איזו בעיה מתוארת כאן?",
            "נתונות המשימות הבאות. לפי תהליך הבדיקות הבסיסי שלמדנו, מהו הסדר הנכון למשימות אלה? א. העברה ל reOpen ב. בחירת ערכי קצה ג. חלוקה למנות בדיקה ד. פירוק פונקציונלי",
            "מה מכל הבאים, יכול בוודאות להגדיל א ה- CC?",
            "בגרסת התוכנה החדשה מהיום, התקבל תיקון לבעיה שדווחה אתמול. נמסר לנו בנוסף, שהתוכנה כולה קומפלה עם ספריה חדשה, שנועדה לתמיכה ב יכולות חדשות בתוכנה. מה כדאי לעשות, במצב כזה?",
            "מחלקת הבדיקות קבלה עדכון מהלקוח, על בעיה שנתגלתה. הבעיה לא נתגלתה במהלך תקופת הבדיקות היות ובשלבי הניתוח והעיצוב הוחלט להתמקד בהקטנת מספר התקלות הפתוחות שהצטברו מהגרסאות הקודמות של התוכנה. איזה עקרון בדיקה הופר כאן?",
            "בודק חרוץ במיוחד כתב אוטומציה שעובדת עבור בדיקות רגרסיה לגרסת תכנה מסוימת. בעת קבלת גרסת תוכנה חדשה, האוטומציה רצה אבל בסופו של דבר נכשלת ולא משלימה את הפעולה. מכל הר\"צב יכול להיות סיבה הכי הגיונית לבעיה?",
            "מה מהבאים יכול בוודאות לגרום לקיצור של הנתיב הקריטי, בעת ביצוע בדיקות אמינות ?",
    };
    private String[] ans1 = new String[]{
            "תעדוף שחרור סבבי פיתוח רכיבים ללקוח",
            "בדיקות data driven",
            "בעית שימושיות",
            "ד->ב->ג->א",
            "לעבור מהפעלת בקרה כתגובה לאיום מתגלה להפעלת בקרה באופן שוטף פעם בשעה",
            "ערכי קצה",
            "שלב תכנון",
            "סנכרון",
            "הגדלת ה cache",
            "תעדוף שחרור סבבים של פיתוחים שונים, ללקוח",
            "ניתן לאתר תקלות בכסוי הצהרות, ולא ניתן לאתר תקלות בכסוי data flow",
            "בדיקת שמושיות הנסמכת על סטטיסטיקות משתמשים ברחבי העולם",
            "בעית שימושיות",
            "ד->ב->ג->א",
            "העברת חלק מהקוד לפונקציה חיצונית",
            "בדיקות אימות ובדיקות רגרסיה",
            "צרות באות בצרורות",
            "מזהה אחד הפקדים השתנה בגרסת התוכנה החדשה",
            "הסבה לkeyword driven",
    };
    private String[] ans2 = new String[]{
            "הבהרת דרישות לא ברורות לצוות הפיתוח",
            "בדיקות unit",
            "בעית בצועים",
            "ד->ג->א->ב",
            "להחליף מודול ישן בשני מודולים חדשים )אשר מבצעים את אותן הפעולות(",
            "טבלת החלטה",
            "שלב עיצוב",
            "טעות בשם אחד הפקדים",
            "שינוי בדרישות שיגרור שינוי שיש ליישם בממשק המשתמש",
            "קביעת לוחות זמנים",
            "לא ניתן לאתר תקלות בכסוי הצהרות, ניתן לאתר תקלות בכסוי  data flow",
            "הזנת קלטים לבדיקה אשר מנוהלים בתוך בסיס נתונים",
            "בעית בצועים",
            "ד->ג->א->ב",
            "להחליף for בwhile",
            "בדיקות שפיות ובדיקות פרוגרסיה",
            "בדיקות מתישות אינן ישימות",
            "חסרה גישה לבסיס הנתונים",
            "הפעלת מספר עמדות בדיקה במקביל",
    };
    private String[] ans3 = new String[]{
            "קבלת משוב מהלקוח",
            "בדיקות Capture & replay",
            "בעית נגישות",
            "ג->ד->ב->א",
            "לעבור מהפעלת בקרה באופן שוטף פעם בשעה להפעלת בקרה כתגובה לאיום מתגלה",
            "לוקליזציה",
            "שלב יישום",
            "בחירת אופציה לא קיימת",
            "שנוי בדרישות שיגרום לשינוי פונקציונלי שיש ליישם בצד השרת",
            "קבלת משוב השלמת פערים מול הלקוח",
            "ניתן לאתר תקלות בכסוי הצהרות, ניתן לאתר תקלות בכסוי  data flow",
            "כסוי הקוד ואיתר כל מעברי ה data הלא חוקיים",
            "בעית נגישות",
            "ג->ד->ב->א",
            "הוספת פקודת else if",
            "בדיקות קופסא לבנה לספריה החדשה",
            "בדיקות הינן תלויות הקשר",
            "עדכון בגרסת הדפדפן המריץ את האוטומציה",
            "העלאת סף הדיווח של הלוג",
    };
    private String[] ans4 = new String[]{
            "דיווח תקלות",
            "בדיקות שימושיות",
            "בעית תאימות",
            "ב->ג->ד->א",
            "להחליף שני מדולים ישנים במודול אחד חדש (אשר מבצעים את אותן הפעולות)",
            "שימושיות",
            "שלב ביצוע",
            "בעית התקנה",
            "החלפת ה P",
            "דיווח תקלות",
            "לא ניתן לאתר תקלות בכסוי הצהרות, לא ניתן לאתר תקלות בכסוי  data flow",
            "כל אוטומציה שהיא",
            "בעית תאימות",
            "ב->ג->ד->א",
            "להגדיל מערך עליו רצה לולאת f",
            "בדיקות התקנה",
            "פאראדוקס מדביר החרקים",
            "בעית התקנה של האוטומציה",
            "הוספת  virtual users",
    };
    private int[] answers = new int[]{
            1,
            2,
            1,
            1,
            3,
            1,
            3,
            1,
            3,
            3,
            3,
            2,
            2,
            1,
            3,
            1,
            4,
            1,
            3,
    };

    private int[] scores = new int[]{
        10, 10, 10,
        20, 20, 20,
        30, 30, 30,
            10, 10, 10,
            20, 20, 20,
            30, 30, 30,30
    };


    private String[] descriptions = new String[] {
            "sem1_y_2022_1",
            "sem1_y_2022_2",
            "sem1_y_2022_3",
            "sem1_y_2022_4",
            "sem1_y_2022_5",
            "sem1_y_2022_6",
            "sem1_y_2022_7",
            "sem1_y_2022_8",
            "sem1_y_2022_9",
            "sem1_y_2022_10",
            "sem1_y_2022_11",
            "sem1_y_2022_12",
            "sem1_y_2022_13",
            "sem1_y_2022_14",

            "sem1_y_2022_16",
            "sem1_y_2022_17",
            "sem1_y_2022_18",
            "sem1_y_2022_19",
            "sem1_y_2022_20",
            "sem1_y_2022_21",
            "sem1_y_2022_22",
            "sem1_y_2022_23",
            "sem1_y_2022_24",

            "sem1_1_2022_1",
            "sem1_1_2022_2",
            "sem1_1_2022_3",
            "sem1_1_2022_4",
            "sem1_1_2022_5",
            "sem1_1_2022_6",
    };

    private int score = 0;
    private int index = 0;
    private int wrong = 0;
    private int life;

    private ArrayList<Question> questions;

    public GameManager(int life) {
        this.life = life;
        this.isLocked = false;
        questions = new ArrayList<>();
        for (int i = 0; i < names.length; i++) {
            Question c = new Question()
                    .setQuestion(names[i])
                    .setScore(scores[i])
                    .setImage(flags[i])
                    .setCorrect(answers[i])
                    .setAns1(ans1[i]).setAns2(ans2[i]).setAns3(ans3[i]).setAns4(ans4[i])
                    .setDescription(descriptions[i]);

            questions.add(c);
        }

    }

    public void lock(){
        this.isLocked = true;
    }
    public void unlock(){
        this.isLocked = false;
    }

    public boolean isLocked(){return this.isLocked;}

    public int getScore() {
        return score;
    }

    public int getCurrentFlag() {
        return flags[index];
    }

    public String getCurrentName() {
        return names[index];
    }

    public int getWrong() {
        return wrong;
    }

    public boolean isGameEnded(){
        return index >= flags.length;
    }

    public boolean isLose(){
        return life == wrong;
    }

    public int checkAnswer(int answer){
        int correct = answers[index];
        if (correct == answer)
            score += scores[index];
        else
            wrong++;

        index++;
        return correct;
    }

    public String getAnswer1() {
        return ans1[index];
    }


    public String getAnswer2() {
        return ans2[index];
    }

    public String getAnswer3() {
        return ans3[index];
    }

    public String getAnswer4() {
        return ans4[index];
    }
}
